<a href="https://colab.research.google.com/github/adb2210/BigData/blob/main/Assignment_3(202301003).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
data=[[1,'Yes','Single',125000,'No'],
       [2,'No','Married',100000,'No'],
        [3,'No','Single',70000,'No'],
         [4,'Yes','Married',120000,'No'],
          [5,'No','Divorced',95000,'Yes'],
           [6,'No','Married',60000,'No'],
            [7,'Yes','Divorced',220000,'No'],
             [8,'No','Single',85000,'Yes'],
              [9,'No','Married',75000,'No'],
               [10,'No','Single',90000,'Yes']]
dataSet=pd.DataFrame(data,columns=['Tid','Refund','Marital Status','Taxable Income','Cheat'])
print(dataSet)
print('Row 0:')
print(dataSet.iloc[0])
print('Row 4:')
print(dataSet.iloc[4])
print('Row 7:')
print(dataSet.iloc[7])
print('Row 8:')
print(dataSet.iloc[8])

   Tid Refund Marital Status  Taxable Income Cheat
0    1    Yes         Single          125000    No
1    2     No        Married          100000    No
2    3     No         Single           70000    No
3    4    Yes        Married          120000    No
4    5     No       Divorced           95000   Yes
5    6     No        Married           60000    No
6    7    Yes       Divorced          220000    No
7    8     No         Single           85000   Yes
8    9     No        Married           75000    No
9   10     No         Single           90000   Yes
Row 0:
Tid                    1
Refund               Yes
Marital Status    Single
Taxable Income    125000
Cheat                 No
Name: 0, dtype: object
Row 4:
Tid                      5
Refund                  No
Marital Status    Divorced
Taxable Income       95000
Cheat                  Yes
Name: 4, dtype: object
Row 7:
Tid                    8
Refund                No
Marital Status    Single
Taxable Income     85000
Cheat                Yes
Name: 7, dtype: object
Row 8:
Tid                     9
Refund                 No
Marital Status    Married
Taxable Income      75000
Cheat                  No
Name: 8, dtype: object

In [4]:
df=pd.read_csv('/content/company_sales_data.csv')
print(df)

    month_number  facecream  facewash  toothpaste  bathingsoap  shampoo  \
0              1       2500      1500        5200         9200     1200
1              2       2630      1200        5100         6100     2100
2              3       2140      1340        4550         9550     3550
3              4       3400      1130        5870         8870     1870
4              5       3600      1740        4560         7760     1560
5              6       2760      1555        4890         7490     1890
6              7       2980      1120        4780         8980     1780
7              8       3700      1400        5860         9960     2860
8              9       3540      1780        6100         8100     2100
9             10       1990      1890        8300        10300     2300
10            11       2340      2100        7300        13300     2400
11            12       2900      1760        7400        14400     1800

    moisturizer  total_units  total_profit
0          1500        21100        211000
1          1200        18330        183300
2          1340        22470        224700
3          1130        22270        222700
4          1740        20960        209600
5          1555        20140        201400
6          1120        29550        295500
7          1400        36140        361400
8          1780        23400        234000
9          1890        26670        266700
10         2100        41280        412800
11         1760        30020        300200